# Import

In [29]:
from typing import List, Dict, Optional
from collections import deque, Counter
from sortedcontainers import SortedList

# support for maintaining a list in sorted order
# without having to sort the list after each insertion
from bisect import bisect_left, bisect_right, insort_left, insort_right

import pandas as pd
import numpy as np

from heapq import heappop, heappush, heapify, heapreplace

Array/String - E
Array/String - M
Two Pointers - E
Two Pointers - M
Sliding Window - M
Matrix - M
Hashmap - E
Hashmap - M
Intervals - E
Intervals - M
Stack - E
Stack - M
Linked List - E
Linked List - M
Binary Tree General - E
Binary Tree General - M
Binary Tree BFS - E
Binary Tree BFS - M
Binary Search Tree - E
Binary Search Tree - M
Graph General - M
Graph BFS - M
Trie - M
Backtracking - M
Divide $ Conquer - E
Divide $ Conquer - M
Kadane's Algorithm - M
Binary Search - E
Binary Search - M
Heap - M
Bit Manipulation - E
Bit Manipulation - M
Math - E
Math - M
1D DP - E
1D Dp - M
Multidimensional DP - M

In [ ]:
def get_bit(num: int, pos: int):
    return num >> pos & 1

In [ ]:
def bit_list_to_int(bit_list: List[int]):
    res = 0
    for pos, bit in enumerate(bit_list):
        if bit == 1:
            res |= bit << pos
    return res

In [31]:
sorted([(2, 1), (4, 5), (1, 6)])

[(1, 6), (2, 1), (4, 5)]

In [34]:
def countPairs(numbers, k):
    # Write your code here
    if k == 0:
        return len(numbers)

    num_set = sorted(set(numbers))

    count = 0
    for i in range(len(num_set) - 1):
        if num_set[i] + k == num_set[i + 1]:
            count += 1

    return count

In [36]:
countPairs([2, 3, 4, 5, 6, 2], 2)

0

In [37]:
1 in set([1, 4, 3])

True

In [42]:
1733069570 - 30 * 24 * 3600 + 12 * 3600

1730520770

In [43]:
from datetime import datetime
import pytz

NY_TZ = pytz.timezone("America/New_york")

ny_dt = datetime.fromtimestamp(1730520770, tz=NY_TZ)
ny_dt

datetime.datetime(2024, 11, 2, 0, 12, 50, tzinfo=<DstTzInfo 'America/New_York' EDT-1 day, 20:00:00 DST>)

In [54]:
lmt_dt = datetime.strptime("2024/11/02", "%Y/%m/%d").replace(tzinfo=NY_TZ)
lmt_dt = NY_TZ.localize(datetime.strptime("2024/11/02", "%Y/%m/%d"))
lmt_dt

datetime.datetime(2024, 11, 2, 0, 0, tzinfo=<DstTzInfo 'America/New_York' EDT-1 day, 20:00:00 DST>)

datetime.datetime(2024, 11, 2, 0, 0, tzinfo=<DstTzInfo 'America/New_York' EDT-1 day, 20:00:00 DST>)

In [51]:
ny_dt - lmt_dt

datetime.timedelta(seconds=770)

In [52]:
(ny_dt - lmt_dt).total_seconds() // 60

12.0

In [24]:
(
    datetime.fromtimestamp(1733069570 + 30 * 3600, tz=NY_TZ) - ny_dt
).total_seconds() // 3600

41.0

In [33]:
sorted(set([1, 4, 3]))

[1, 3, 4]

In [ ]:
[center[1] for center in sorted(centers)]

# Test Pandas

In [27]:
df = pd.DataFrame(
    {
        "A": [1, 2, 3, np.nan, 5, np.nan, 1],
        "B": [6, 7, np.nan, 9, 10, 6, 0],
        "C": ["a", "a", "c", "c", "b", "a", "a"],
        "D": [1, 3, 4, 4, 2, 2, 2],
    }
)
df

     A     B  C  D
0  1.0   6.0  a  1
1  2.0   7.0  a  3
2  3.0   NaN  c  4
3  NaN   9.0  c  4
4  5.0  10.0  b  2
5  NaN   6.0  a  2
6  1.0   0.0  a  2

In [87]:
df_2 = pd.DataFrame(
    {
        "C": ["a", "b", "c"],
        "E": ["A", "B", None],
    }
)

In [96]:
df_2["E"] + "_" + df_2["C"]

0    A_a
1    B_b
2    NaN
dtype: object

In [99]:
0 >> 1

0

In [ ]:
def findNumberSequence(direction):
    # Write your code here
    n = len(direction)
    
    left_center = 2**n
    right_center = 
    index_list = []
    for i in range(n):
        center = (left + right) // 2
        centers.append((center, i + 1))
        if direction[i] == "L":
            right = center
        else:
            left = center
                
    return [center[1] for center in sorted(centers)]

In [ ]:
#
# Complete the 'findNumberSequence' function below.
#
# The function is expected to return an INTEGER_ARRAY.
# The function accepts STRING direction as parameter.
#


def findNumberSequence(direction):
    # Write your code here
    n = len(direction)

    left = 0
    right = 2**n
    centers = []
    for i in range(n):
        center = (left + right) // 2
        centers.append((center, i + 1))
        if direction[i] == "L":
            right = center
        else:
            left = center

    return [center[1] for center in sorted(centers)]

In [103]:
def findNumberSequence(direction):
    # Write your code here
    n = len(direction)

    left = 0
    right = 2**n
    centers = []
    for i in range(n):
        center = (left + right) // 2
        centers.append((center, i + 1))
        if direction[i] == "L":
            right = center
        else:
            left = center

    return [center[1] for center in sorted(centers)]

In [ ]:
def findNumberSequence(direction):
    # Write your code here
    n = len(direction)

    right = 1
    index_list = [1]
    for i in range(1, n):
        if direction[i] == "L":
            index_list.inser(i, right + 1)
            right = right + 1
            i
        else:
            index_list.inser(i, left)
            right = left + 1

    return [center[1] for center in sorted(centers)]

In [109]:
a = [1, 2, 3]
a.insert(3, 5)
a

[1, 2, 3, 5]

In [ ]:
findNumberSequence("LRRLLL")

In [104]:
findNumberSequence("LRRLLL")

[2, 3, 6, 5, 4, 1]

In [101]:
test = pd.DataFrame({"A": []})
test["B"] = 0

In [94]:
df_2["E"].mode()

0    A
1    B
Name: E, dtype: object

In [92]:
df_2[["E"]].fillna(df_2[["E"]].mode(skipna=True))

TypeError: mode() got an unexpected keyword argument 'skipna'

In [66]:
df = pd.DataFrame(
    {
        "A": [1, 2, 3, np.nan, 5, np.nan, 1],
        "B": [6, 7, np.nan, 9, 10, 6, 0],
        "subjects": ["a b c", "a b", "a b c", "a b c", "b", "a", "a"],
        "state_code": ["^aa1", "aa$1", "bb2", "c#1", "!@c_1", "c 1", "c.1"],
        "school_id": [1, 2, 3, 4, 6, 5, 7],
    }
)
df

     A     B subjects state_code  school_id
0  1.0   6.0    a b c       ^aa1          1
1  2.0   7.0      a b       aa$1          2
2  3.0   NaN    a b c        bb2          3
3  NaN   9.0    a b c        c#1          4
4  5.0  10.0        b      !@c_1          6
5  NaN   6.0        a        c 1          5
6  1.0   0.0        a        c.1          7

In [81]:
df["subjects"] = df["subjects"].str.split()

In [49]:
df[df["subjects"].str.len() >= 3]

     A    B   subjects state_code  school_id
0  1.0  6.0  [a, b, c]       ^aa1          1
2  3.0  NaN  [a, b, c]        bb2          3
3  NaN  9.0  [a, b, c]        c#1          4

In [75]:
df.loc[:, ["state_code"]] = df["state_code"].str.replace("[a-zA-Z0-9]", "")

<ipython-input-75-a50e30f121cf>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df.loc[:, ["state_code"]] = df["state_code"].str.replace("[^a-zA-Z0-9]", "")

In [70]:
df

     A     B subjects state_code  school_id
0  1.0   6.0    a b c        aa1          1
1  2.0   7.0      a b        aa1          2
2  3.0   NaN    a b c        bb2          3
3  NaN   9.0    a b c         c1          4
4  5.0  10.0        b         c1          6
5  NaN   6.0        a         c1          5
6  1.0   0.0        a         c1          7

In [ ]:
df["state_code"].str.

In [67]:
df["state_code"].str.replace("\W", "")

<ipython-input-67-b902c559e3b6>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df["state_code"].str.replace("\W", "")

0    aa1
1    aa1
2    bb2
3     c1
4    c_1
5     c1
6     c1
Name: state_code, dtype: object

In [53]:
df["state_code"] = df["state_code"].str.replace("[^a-zA-Z0-9]", "")

<ipython-input-53-6fc5825617b1>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df["state_code"] = df["state_code"].str.replace("[^a-zA-Z0-9]", "")

In [82]:
exploded_df = df.explode("subjects")
exploded_df

     A     B subjects state_code  school_id
0  1.0   6.0        a        aa1          1
0  1.0   6.0        b        aa1          1
0  1.0   6.0        c        aa1          1
1  2.0   7.0        a        aa1          2
1  2.0   7.0        b        aa1          2
2  3.0   NaN        a        bb2          3
2  3.0   NaN        b        bb2          3
2  3.0   NaN        c        bb2          3
3  NaN   9.0        a         c1          4
3  NaN   9.0        b         c1          4
3  NaN   9.0        c         c1          4
4  5.0  10.0        b         c1          6
5  NaN   6.0        a         c1          5
6  1.0   0.0        a         c1          7

In [83]:
df

     A     B   subjects state_code  school_id
0  1.0   6.0  [a, b, c]        aa1          1
1  2.0   7.0     [a, b]        aa1          2
2  3.0   NaN  [a, b, c]        bb2          3
3  NaN   9.0  [a, b, c]         c1          4
4  5.0  10.0        [b]         c1          6
5  NaN   6.0        [a]         c1          5
6  1.0   0.0        [a]         c1          7

In [80]:
exploded_df[exploded_df["subjects"]]

     A     B subjects state_code  school_id
0  1.0   6.0    a b c        aa1          1
1  2.0   7.0      a b        aa1          2
2  3.0   NaN    a b c        bb2          3
3  NaN   9.0    a b c         c1          4
4  5.0  10.0        b         c1          6
5  NaN   6.0        a         c1          5
6  1.0   0.0        a         c1          7

In [86]:
df.columns

Index(['A', 'B', 'subjects', 'state_code', 'school_id'], dtype='object')

In [85]:
exploded_df.pivot_table(
    index=["a", "b", "c"],
    columns="subjects",
    values="school_id",
    aggfunc="count",
    fill_value=0,
).reset_index()

KeyError: 'a'

In [5]:
df.drop_duplicates(subset=["C"])

     A     B  C  D
0  1.0   6.0  a  1
2  3.0   NaN  c  4
4  5.0  10.0  b  2

In [6]:
df.dropna(subset=["C"])

     A     B  C  D
0  1.0   6.0  a  1
1  2.0   7.0  a  3
2  3.0   NaN  c  4
3  NaN   9.0  c  4
4  5.0  10.0  b  2
5  NaN   6.0  a  2
6  1.0   0.0  a  2

In [7]:
df.dropna(subset=["C", "A"], how="all")

     A     B  C  D
0  1.0   6.0  a  1
1  2.0   7.0  a  3
2  3.0   NaN  c  4
3  NaN   9.0  c  4
4  5.0  10.0  b  2
5  NaN   6.0  a  2
6  1.0   0.0  a  2

In [8]:
df.dropna(subset=["C", "A"], how="any")

     A     B  C  D
0  1.0   6.0  a  1
1  2.0   7.0  a  3
2  3.0   NaN  c  4
4  5.0  10.0  b  2
6  1.0   0.0  a  2

In [9]:
def nth_highest(df: pd.DataFrame, col: str, n: int):
    values = sorted(df["D"].unique(), reverse=True)
    if len(values) < n:
        return pd.DataFrame({"value": [None]})
    return pd.DataFrame({"value": [values[n - 1]]})

In [10]:
unique_values = df["D"].unique()
unique_values.sort()
unique_values

array([1, 2, 3, 4], dtype=int64)

In [11]:
df["row_num"] = (
    df.sort_values(by=["C", "D"], ascending=[True, False])
    .groupby(["C"])["D"]
    .cumcount()
)
df["rank"] = df.groupby(["C"])["D"].rank()
df["rank_2"] = df.groupby(["C"])["D"].rank(method="min", ascending=False)
df["dense_rank"] = df.groupby(["C"])["D"].rank(method="dense")
df["max"] = df.groupby(["C"])["D"].transform(max)
df.sort_values(by=["C", "D"])

     A     B  C  D  row_num  rank  rank_2  dense_rank  max
0  1.0   6.0  a  1        3   1.0     4.0         1.0    3
5  NaN   6.0  a  2        1   2.5     2.0         2.0    3
6  1.0   0.0  a  2        2   2.5     2.0         2.0    3
1  2.0   7.0  a  3        0   4.0     1.0         3.0    3
4  5.0  10.0  b  2        0   1.0     1.0         1.0    2
2  3.0   NaN  c  4        0   1.5     1.0         1.0    4
3  NaN   9.0  c  4        1   1.5     1.0         1.0    4

In [12]:
df["max"] = df.groupby(["C"])["D"].transform(max)
df[df["D"] == df["max"]].merge(
    df_2, left_on="C", right_on="C", suffixes=("", "_right")
)

     A     B  C  D  row_num  rank  rank_2  dense_rank  max  E
0  2.0   7.0  a  3        0   4.0     1.0         3.0    3  A
1  3.0   NaN  c  4        0   1.5     1.0         1.0    4  C
2  NaN   9.0  c  4        1   1.5     1.0         1.0    4  C
3  5.0  10.0  b  2        0   1.0     1.0         1.0    2  B

In [13]:
df.rename(columns={"C": "id"})

     A     B id  D  row_num  rank  rank_2  dense_rank  max
0  1.0   6.0  a  1        3   1.0     4.0         1.0    3
1  2.0   7.0  a  3        0   4.0     1.0         3.0    3
2  3.0   NaN  c  4        0   1.5     1.0         1.0    4
3  NaN   9.0  c  4        1   1.5     1.0         1.0    4
4  5.0  10.0  b  2        0   1.0     1.0         1.0    2
5  NaN   6.0  a  2        1   2.5     2.0         2.0    3
6  1.0   0.0  a  2        2   2.5     2.0         2.0    3

In [14]:
df.groupby(["C"])["D"].transform(max)

0    3
1    3
2    4
3    4
4    2
5    3
6    3
Name: D, dtype: int64

In [15]:
df.groupby(["C"])["D"].max()

C
a    3
b    2
c    4
Name: D, dtype: int64

In [16]:
df.merge(df_2, left_on="C", right_on="C", suffixes=("_left", "_right"))

     A     B  C  D  row_num  rank  rank_2  dense_rank  max  E
0  1.0   6.0  a  1        3   1.0     4.0         1.0    3  A
1  2.0   7.0  a  3        0   4.0     1.0         3.0    3  A
2  NaN   6.0  a  2        1   2.5     2.0         2.0    3  A
3  1.0   0.0  a  2        2   2.5     2.0         2.0    3  A
4  3.0   NaN  c  4        0   1.5     1.0         1.0    4  C
5  NaN   9.0  c  4        1   1.5     1.0         1.0    4  C
6  5.0  10.0  b  2        0   1.0     1.0         1.0    2  B

In [17]:
# use if there only 1 max
df.loc[df.groupby(["C"])["D"].idxmax()]

     A     B  C  D  row_num  rank  rank_2  dense_rank  max
1  2.0   7.0  a  3        0   4.0     1.0         3.0    3
4  5.0  10.0  b  2        0   1.0     1.0         1.0    2
2  3.0   NaN  c  4        0   1.5     1.0         1.0    4

In [ ]:
# def department_highest_salary(
#     employee: pd.DataFrame, department: pd.DataFrame
# ) -> pd.DataFrame:
#     employee["max"] = employee.groupby(["departmentId"])["salary"].transform(
#         max
#     )
#     employee = employee[employee["salary"] == employee["max"]]
#     return employee.merge(
#         department,
#         left_on="departmentId",
#         right_on="id",
#         suffixes=("", "_dept"),
#     ).rename(
#         columns={
#             "name_dept": "Department",
#             "name": "Employee",
#             "salary": "Salary",
#         }
#     )[
#         ["Department", "Employee", "Salary"]
#     ]

In [18]:
df["D"].rank(method="dense")

0    1.0
1    3.0
2    4.0
3    4.0
4    2.0
5    2.0
6    2.0
Name: D, dtype: float64

In [19]:
df.sort_values(by="D")

     A     B  C  D  row_num  rank  rank_2  dense_rank  max
0  1.0   6.0  a  1        3   1.0     4.0         1.0    3
4  5.0  10.0  b  2        0   1.0     1.0         1.0    2
5  NaN   6.0  a  2        1   2.5     2.0         2.0    3
6  1.0   0.0  a  2        2   2.5     2.0         2.0    3
1  2.0   7.0  a  3        0   4.0     1.0         3.0    3
2  3.0   NaN  c  4        0   1.5     1.0         1.0    4
3  NaN   9.0  c  4        1   1.5     1.0         1.0    4

In [ ]:
# def order_scores(scores: pd.DataFrame) -> pd.DataFrame:
#     scores["rank"] = scores["score"].rank(method="dense", ascending=False)
#     return scores.sort_values(by="rank")[["score", "rank"]]

In [20]:
def get_cate(value: int):
    if value < 3:
        return "< 3"
    elif value < 4:
        return "= 3"
    else:
        return "= 4"


df["category"] = df["D"].map(lambda val: get_cate(val))
df

     A     B  C  D  row_num  rank  rank_2  dense_rank  max category
0  1.0   6.0  a  1        3   1.0     4.0         1.0    3      < 3
1  2.0   7.0  a  3        0   4.0     1.0         3.0    3      = 3
2  3.0   NaN  c  4        0   1.5     1.0         1.0    4      = 4
3  NaN   9.0  c  4        1   1.5     1.0         1.0    4      = 4
4  5.0  10.0  b  2        0   1.0     1.0         1.0    2      < 3
5  NaN   6.0  a  2        1   2.5     2.0         2.0    3      < 3
6  1.0   0.0  a  2        2   2.5     2.0         2.0    3      < 3

In [21]:
df.groupby("category", as_index=False).agg(accounts_count=("D", "count"))

  category  accounts_count
0      < 3               4
1      = 3               1
2      = 4               2

In [ ]:
# column_name = "A"
# groupby_df = df.groupby("C", as_index=False).agg(
#     quantile_5=(column_name, lambda s: s.quantile(0.05)),
#     quantile_25=(column_name, lambda s: s.quantile(0.25)),
#     quantile_50=(column_name, "median"),
#     quantile_75=(column_name, lambda s: s.quantile(0.75)),
#     quantile_95=(column_name, lambda s: s.quantile(0.95)),
#     mean=(column_name, "mean"),
#     std=(column_name, "std"),
# )

In [ ]:
def count_salary_categories(accounts: pd.DataFrame) -> pd.DataFrame:
    def get_cate(value: int):
        if value < 20000:
            return "Low Salary"
        elif value <= 50000:
            return "Average Salary"
        else:
            return "High Salary"

    accounts["category"] = accounts["income"].map(lambda val: get_cate(val))
    return accounts.groupby("category", as_index=False).agg(
        accounts_count=("account_id", "count")
    )


def count_salary_categories_v2(accounts: pd.DataFrame) -> pd.DataFrame:
    low_salary_count = accounts[accounts["income"] < 20000].shape[0]
    average_salary_count = accounts[
        (accounts["income"] >= 20000) & (accounts["income"] <= 50000)
    ].shape[0]
    high_salary_count = accounts[accounts["income"] > 50000].shape[0]

    return pd.DataFrame(
        {
            "category": ["Low Salary", "Average Salary", "High Salary"],
            "accounts_count": [
                low_salary_count,
                average_salary_count,
                high_salary_count,
            ],
        }
    )

In [22]:
count_sr = df.groupby("A").size()
res_sr = count_sr[count_sr > 1]
pd.DataFrame({"A": res_sr.index}).merge(df, on="A")

     A    B  C  D  row_num  rank  rank_2  dense_rank  max category
0  1.0  6.0  a  1        3   1.0     4.0         1.0    3      < 3
1  1.0  0.0  a  2        2   2.5     2.0         2.0    3      < 3

In [25]:
count_df = df.groupby("A").size().reset_index(name="count")
count_df
# count_df.merge(df, left_on="A", right_on="A")

# count_sr[count_sr > 1]

     A  count
0  1.0      2
1  2.0      1
2  3.0      1
3  5.0      1

In [26]:
count_sr = (
    df.groupby("A", as_index=False)
    .agg(
        num_rows=("D", "count"),
    )
    .query("num_rows >= 2")["A"]
)

df[df["A"].isin(count_sr)]

     A    B  C  D  row_num  rank  rank_2  dense_rank  max category
0  1.0  6.0  a  1        3   1.0     4.0         1.0    3      < 3
6  1.0  0.0  a  2        2   2.5     2.0         2.0    3      < 3

In [ ]:
def find_managers(employee: pd.DataFrame) -> pd.DataFrame:
    count_sr = employee.groupby("managerId").size()
    res_sr = count_sr[count_sr >= 5]
    return pd.DataFrame({"id": res_sr.index}).merge(employee, on="id")[
        ["name"]
    ]


def find_managers_v2(employee: pd.DataFrame) -> pd.DataFrame:
    managers = (
        employee.groupby("managerId", as_index=False)
        .agg(
            direct_reports=("id", "count"),
        )
        .query("direct_reports >= 5")["managerId"]
    )

    return employee[employee["id"].isin(managers)][["name"]]


def find_managers_v3(employee: pd.DataFrame) -> pd.DataFrame:
    manager_df = (
        employee.groupby("managerId").size().reset_index(name="direct_reports")
    )
    manager_df = manager_df[manager_df["direct_reports"] >= 5]
    return manager_df.merge(
        employee[["id", "name"]], left_on="managerId", right_on="id"
    )[["name"]]

# Test

In [22]:
print(1.5 // 1, type(1.5 // 1))
print(2 // 1.0, type(2 // 1.0))
print(4 // 1.5, type(4 // 1.5))
print(4 // 2, type(4 // 2))
print(4 / 2, type(4 / 2))

1.0 <class 'float'>
2.0 <class 'float'>
2.0 <class 'float'>
2 <class 'int'>
2.0 <class 'float'>

In [ ]:
a = {"a": [1, 3], "b": [5], "c": [0, 2, 4]}
max(a.items(), key=lambda x: len(x[1]))

In [ ]:
for i in range(1, 3):
    print(i)

In [ ]:
a = "abc"
set(a)

In [ ]:
stack = deque("abc")
stack

In [ ]:
str(list(stack))

In [ ]:
a = "a"

In [ ]:
ord("a") - 97

In [ ]:
[[]] * 2

In [ ]:
len({})

In [ ]:
chr(97)

In [ ]:
ord("A")

In [ ]:
# Disjoint Set Union
# https://cp-algorithms.com/data_structures/disjoint_set_union.html
class SimpleUnionFind:
    parent: Dict[int, int] = {}

    def __init__(self, num_elems: int):
        for i in range(num_elems):
            self.parent[i] = i

    def find_set(self, elem: int):
        if self.parent[elem] == elem:
            return elem
        return self.find_set(self.parent[elem])

    def union_sets(self, elem_1: int, elem_2: int):
        set_1 = self.find_set(elem_1)
        set_2 = self.find_set(elem_2)
        self.parent[set_2] = set_1

In [ ]:
#
class UnionFind:  # DisjointSetUnion
    parent: List[int]
    rank: List[int]

    def __init__(self, num_elems: int):
        self.parent = list(range(num_elems))
        self.rank = [0] * num_elems

    def find_set(self, elem: int):
        if self.parent[elem] == elem:
            return elem
        return self.find_set(self.parent[elem])

    def union_sets(self, elem_1, elem_2):
        set_1 = self.find_set(elem_1)
        set_2 = self.find_set(elem_2)

        if self.rank[set_1] < self.rank[set_2]:
            self.parent[set_1] = set_2
        elif self.rank[set_1] > self.rank[set_2]:
            self.parent[set_2] = set_1
        else:
            self.parent[set_1] = set_2
            self.rank[set_2] += 1

In [ ]:
#
class UnionFind:  # DisjointSetUnion
    parent: List[int]
    rank: List[int]

    def __init__(self, num_elems: int):
        self.parent = list(range(num_elems))
        self.rank = [0] * num_elems

    def find_set(self, elem: int):
        if self.parent[elem] == elem:
            return elem
        self.parent[elem] = self.find_set(self.parent[elem])
        return self.parent[elem]

    def union_sets(self, elem_1, elem_2):
        set_1 = self.find_set(elem_1)
        set_2 = self.find_set(elem_2)

        if self.rank[set_1] < self.rank[set_2]:
            self.parent[set_1] = set_2
        elif self.rank[set_1] > self.rank[set_2]:
            self.parent[set_2] = set_1
        else:
            self.parent[set_1] = set_2
            self.rank[set_2] += 1

## Bisect (Sorted List/Binary Search)

In [3]:
import bisect

In [5]:
nums = [1, 3, 5, 6]
target = 5
print(bisect.bisect_left(nums, target))
print(bisect.bisect_right(nums, target))
bisect.insort_left(nums, target)
print(nums)

2
3
[1, 3, 5, 5, 6]

In [6]:
matrix = [[1, 3, 5, 7], [10, 11, 16, 20], [23, 30, 34, 60]]
bisect.bisect_left(matrix, 12)

TypeError: '<' not supported between instances of 'list' and 'int'